tap "homebrew/cask-fonts"
tap "koekeishiya/formulae"
tap "FelixKratz/formulae"
tap "nikitabobko/tap/aerospace"
cask_args appdir: "~/Applications", require_sha: true

brew "git"
brew "zsh"
brew "mas"
brew "htop"
brew "btop"
brew "neovim"
brew "ripgrep"
brew "wget"
brew "cmake"
brew "open-mpi"
brew "tree"
brew "llvm"
brew "libomp"
brew "tmux"
brew "node"
brew "go"
brew "jq"
brew "python"
brew "pandoc"
brew "grip"
brew "ifstat"
brew "gcc"
brew "newsboat"
brew "mpv"

brew "aerospace"
brew "skhd", args: ["with-logging"]
brew "sketchybar", args:  ["HEAD"], restart_service: :changed
brew "borders", restart_service: :changed

cask "raycast"
cask "alacritty"
cask "docker"
cask "musescore"
cask "sioyek"
cask "mactex-no-gui"
cask "font-hack-nerd-font"
cask "lulu"
cask "zoom"
cask "zotero"
cask "signal"
cask "anki"
cask "mattermost"

mas "iReal Pro", id: 409035833
mas "Telegram", id: 747648890
mas "Bitwarden", id: 1352778147
