tap "homebrew/cask-fonts"
tap "koekeishiya/formulae"
tap "FelixKratz/formulae"

brew "git"
brew "zsh"
brew "mas"
brew "htop"
brew "neovim", args: ['head']
brew "ripgrep"
brew "wget"
brew "cmake"
brew "open-mpi"
brew "tree"
brew "llvm"
brew "libomp"
brew "tmux"
brew "node"
brew "go"
brew "jq"
brew "python"
brew "pandoc"
brew "grip"
brew "ifstat"
brew "gcc"

brew "yabai", args: ["head"]
brew "skhd", args: ["with-logging"], restart_service: :changed
brew "sketchybar", args:  ["--head"], restart_service: :changed

cask "alfred"
cask "alacritty"
cask "docker"
cask "vlc"
cask "musescore"
cask "gpg-suite"
cask "sioyek"
cask "mactex-no-gui"
cask "font-hack-nerd-font"
cask "firefox"
cask "lulu"
cask "zoom"
cask "zotero"
cask "signal"
cask "anki"
cask "mattermost"

mas "iReal Pro", id: 409035833
mas "Telegram", id: 747648890
mas "Bitwarden", id: 1352778147
