tap "asmvik/formulae"
tap "FelixKratz/formulae"
cask_args appdir: "~/Applications", require_sha: true

brew "git"
brew "zsh"
brew "mas"
brew "htop"
brew "neovim"
brew "ripgrep"
brew "wget"
brew "cmake"
brew "open-mpi"
brew "tree"
brew "llvm"
brew "libomp"
brew "tmux"
brew "node"
brew "go"
brew "jq"
brew "python"
brew "pandoc"
brew "grip"
brew "gcc"
brew "mpv"
brew "imagemagick"
brew "uv"
brew "tree-sitter"

brew "yabai"
brew "skhd", args: ["with-logging"]
brew "sketchybar", args:  ["HEAD"], restart_service: :changed
brew "borders"

cask "librewolf",
     postinstall: "/usr/bin/xattr -dr com.apple.quarantine /Applications/LibreWolf.app"
cask "raycast"
cask "ghostty"
cask "musescore"
cask "sioyek"
cask "mactex-no-gui"
cask "font-hack-nerd-font"
cask "sf-symbols"
cask "lulu"
cask "zoom"
cask "zotero"
cask "signal"
cask "anki"
cask "mattermost"
cask "proton-pass"

mas "iReal Pro", id: 409035833
mas "Telegram", id: 747648890
